* Star 1

#+begin_src python :results value
from math import ceil, floor
from operator import mul
from utils import load_s, VectorPoint, Size, padd, Grid, dump_grid, X, Y, WIDTH, HEIGHT, P, V, padd_mod, Rect, p_in_rect
import re
rx = re.compile(r"p=(-?\d+),(-?\d+) v=(-?\d+),(-?\d+)")

def line_to_robot(line: str) -> VectorPoint:
    m = rx.search(line)
    if not m:
        raise Exception(line)
    return ((int(m[1]),int(m[2])),(int(m[3]),int(m[4]))) 

data = [("test.txt", (11,7)),
        ("puzzle.txt", (101,103))]
data_idx = 1

grid_size = data[data_idx][1]
s = load_s(14,data[data_idx][0])

robots = [line_to_robot(line) for line in s.split("\n") if line]

def count(robots: list[VectorPoint]) -> Grid:
    grid = {}
    for robot in robots:
        if grid.get(robot[P]) is None:
            grid[robot[P]] = 0
        grid[robot[P]]+=1

    return grid

def iterate(robots: list[VectorPoint], size: Size, seconds: int):
    for i in range(0,seconds):
        robots = [( padd_mod(robot[P],robot[V], size), robot[V]) for robot in robots]
    return robots

def quadrant(q: int, size: Size) -> Rect:
    rs = (floor(size[WIDTH]/2),floor(size[HEIGHT]/2))
    if q == 0:
        return ((0,0), rs)
    if q == 1:
        return ((ceil(size[WIDTH]/2),0), rs)
    if q == 2:
        return ((0, ceil(size[HEIGHT]/2)), rs)

    return ((ceil(size[WIDTH]/2), ceil(size[HEIGHT]/2)), rs)
    
def count_in_bounds(grid: Grid, bounds: Rect) -> int:
    return sum([v for p,v in grid.items() if p_in_rect(p, bounds)])

robots = iterate(robots, grid_size,100)
counted = count(robots)
r = 1
for q in range(0,4):
    r *= count_in_bounds(counted, quadrant(q,grid_size))

return r

return dump_grid(counted, grid_size, "", int_grid=True)
#+end_src

#+RESULTS:
: 225648864

